export const REGEX_PATTERN = {
  EMAIL: /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9-]+(\.[a-zA-Z]{2,})+$/,
  PHONE: /^(0|\+84)(24|3[2-9]|5[2689]|7[0-9]|8[1-9]|9[0-9])\d{7}$/,
  SPECIAL_CHARACTERS: /^[\p{L}0-9 ]+$/u,
  VALIDATE_TEXT:/^[a-zA-ZÀ-ỹ0-9\s\-\_\.\,\(\)\[\]\{\}]+$/,
  VALIDATE_SPACE:/^[a-zA-Z0-9àáạảãâầấậẩẫăằắặẳẵèéẹẻẽêềếệểễìíịỉĩòóọỏõôồốộổỗơờớợởỡùúụủũưừứựửữỳýỵỷỹđÀÁẠẢÃÂẦẤẬẨẪĂẰẮẶẲẴÈÉẸẺẼÊỀẾỆỂỄÌÍỊỈĨÒÓỌỎÕÔỒỐỘỔỖƠỜỚỢỞỠÙÚỤỦŨƯỪỨỰỬỮỲÝỴỶỸĐ]+$/,
  USER_NAME: /^[a-zA-Z0-9_.@-]+$/,
  FULL_NAME: /^[a-zA-ZàáạảãâầấậẩẫăằắặẳẵèéẹẻẽêềếệểễìíịỉĩòóọỏõôồốộổỗơờớợởỡùúụủũưừứựửữỳýỵỷỹđÀÁẠẢÃÂẦẤẬẨẪĂẰẮẶẲẴÈÉẸẺẼÊỀẾỆỂỄÌÍỊỈĨÒÓỌỎÕÔỒỐỘỔỖƠỜỚỢỞỠÙÚỤỦŨƯỪỨỰỬỮỲÝỴỶỸĐ0-9\s\-']+$/,
};
